#!/bin/bash
################################################################################
##
##	ファイル名	:	addusers_txt_maker.sh
##
##	機能概要	:	addusers.txt作成用シェル
##					(既存sambaユーザーの抜き出し)
##	入出力 I/F
##		INPUT	:	
##		OUTPUT	:	
##
##	作成者		:	J.Itou
##
##	作成日付	:	2016/02/11
##
##	改訂履歴	:	
##	   日付       版         名前      改訂内容
##	---------- -------- -------------- -----------------------------------------
##	2016/02/11 000.0000 J.Itou         新規作成
##	2018/02/25 000.0000 J.Itou         改善対応
##	2018/05/05 000.0000 J.Itou         改善対応
##	YYYY/MM/DD 000.0000 xxxxxxxxxxxxxx 
##	---------- -------- -------------- -----------------------------------------
################################################################################
	set -eu								# ステータス0以外と未定義変数の参照で終了
	trap 'exit 1' 1 2 3 15

# Pause処理 -------------------------------------------------------------------
funcPause() {
	local RET_STS=$1

	if [ ${RET_STS} -ne 0 ]; then
		echo "Enterキーを押して下さい。"
		read DUMMY
	fi
}

#-------------------------------------------------------------------------------
# Initialize
#-------------------------------------------------------------------------------
	#--------------------------------------------------------------------------
	WHO_AMI=`whoami`					# 実行ユーザー名
	if [ "${WHO_AMI}" != "root" ]; then
		echo "rootユーザーで実行して下さい。"
		exit 1
	fi

	# ワーク変数設定 -----------------------------------------------------------
	NOW_TIME=`date +"%Y%m%d%H%M%S"`
	PGM_NAME=`basename $0 | sed -e 's/\..*$//'`

	DST_NAME=`awk '/[A-Za-z]./ {print $1;}' /etc/issue | head -n 1 | tr '[A-Z]' '[a-z]'`

	DIR_WK=.

	LST_USER=${DIR_WK}/addusers.txt

#------------------------------------------------------------------------------
# Make User file
#------------------------------------------------------------------------------
	rm -f ${LST_USER}
	touch ${LST_USER}

	while IFS=':' read WORKNAME USERIDNO LMPASSWD NTPASSWD ACNTFLAG CHNGTIME
	do
		USERNAME="${WORKNAME,,}"
		FULLNAME=`pdbedit -u ${USERNAME} | awk -F : '{print $3;}'`
		PASSWORD=""

		IDGROUPS=`id -G -n ${USERNAME} | awk '/sambaadmin/'`
		if [ "${IDGROUPS}" = "" ]; then
			ADMINFLG=0
		else
			ADMINFLG=1
		fi

		echo "${USERNAME}:${FULLNAME}:${USERIDNO}:${PASSWORD}:${LMPASSWD}:${NTPASSWD}:${ACNTFLAG}:${CHNGTIME}:${ADMINFLG}" >> ${LST_USER}
	done < <(pdbedit -L -w)

#------------------------------------------------------------------------------
# Termination
#------------------------------------------------------------------------------

#------------------------------------------------------------------------------
# Exit
#------------------------------------------------------------------------------
	exit 0

#------------------------------------------------------------------------------
# End of file
#------------------------------------------------------------------------------
